Repository: HarbourMasters/retro
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, nl

# home_createOption
source: Create OTR / O2R
de: Erstelle OTR / O2R
es: Crear OTR / O2R
fr: Créer un OTR / O2R
nl: Maak een OTR / O2R

# home_createOptionSubtitle
source: Create an OTR / O2R for SoH
de: Erstelle eine OTR / O2R für SoH
es: Crear un OTR / O2R para SoH
fr: Créer un OTR / O2R pour SoH
nl: Maak OTR / O2R voor SoH

# home_inspectOption
source: Inspect OTR / O2R
de: Überprüfe OTR / O2R
es: Inspeccionar OTR / O2R
fr: Inspecter un OTR / O2R
nl: Inspecteer een OTR / O2R

# home_inspectOptionSubtitle
source: Inspect the contents of an OTR / O2R
de: Überprüfe die Inhalte einer OTR / O2R
es: Inspeccionar el contenido de un OTR / O2R
fr: Inspecter le contenu d'un OTR / O2R
nl: Inspecteer de inhoud van een OTR / O2R

# createSelectionScreen_title
source: Create Selection
de: Erstelle eine Auswahl
es: Crear selección
fr: Création d'un OTR / O2R
nl: Selectie maken

# createSelectionScreen_subtitle
source: Select the type of selection you want to create
de: Wähle die Kategorie, von der du etwas erstellen willst
es: Seleccione el tipo de selección que desea crear
fr: Sélectionnez le type d'OTR / O2R que vous souhaitez créer
nl: Selecteer het type selectie dat je wilt maken

# createSelectionScreen_nonHdTex
source: Replace Textures
de: Tausche Texturen aus
es: Reemplazar texturas
fr: Remplacer les textures
nl: Vervang textures

# createSelectionScreen_customSequences
source: Custom Sequences
de: Benutzidentifizierte Sequenzen
es: Secuencias personalizadas
fr: Séquences personnalisées
nl: Aangepaste composities

# createSelectionScreen_custom
source: Custom
de: Benutzeridentifiziert
es: Personalizada
fr: Personnalisé
nl: Aangepast

# createReplaceTexturesScreen_Option
source: Replace Textures
de: Tausche Texturen aus
es: Reemplazar texturas
fr: Remplacer les textures
nl: Vervang textures

# createReplaceTexturesScreen_OptionDescription
source: Replace textures from an OTR / O2R with custom ones
de: Tausche Texturen einer OTR / O2R durch andere Texturen aus
es: Reemplace texturas de un OTR / O2R con otras personalizadas
fr: Remplacer les textures d'un OTR / O2R par des textures personnalisées
nl: Vervang textures van een OTR / O2R door aangepaste (niet-hd) textures

# questionContentView_mainQuestion
source: Do you already have a texture replacement folder?
de: Hast du bereits einen Austausch-Texturen Ordner?
es: ¿Ya tiene una carpeta de reemplazo de texturas?
fr: Avez-vous déjà un dossier de remplacement de texture?
nl: Heb je al een map met vervangende textures?

# questionContentView_mainText
source: If you have a folder generated by this tool with replacements, select Yes. If you don't have one, select No and we'll get you started with creating replacements.
de: Falls du einen von diesem Tool generierten Ordner für Austausch-Texturen hast, wähle Ja. Falls du keinen hast, wähle Nein und wir werden sofort mit dem Erstellen von Austuasch-Texturen starten.
es: Si tiene una carpeta generada por esta herramienta con reemplazos, seleccione Sí. De lo contrario, seleccione No y le ayudaremos con la creación de reemplazos.
fr: Si vous avez déjà un dossier de remplacement généré par cet outil, sélectionnez Oui. Si vous n'en avez pas, sélectionnez Non et nous vous aiderons à générer un dossier.
nl: Als je een map heeft die door deze tool is gegenereerd met vervangingen, selecteer Ja. als je er nog geen hebt, selecteer Nee en dan gaan we een map maken.

# questionContentView_yes
source: Yes
de: Ja
es: Sí
fr: Oui
nl: Ja

# questionContentView_no
source: No
de: Nein
fr: Non
nl: Nee

# otrContentView_otrPath
source: OTR / O2R Path
de: OTR / O2R Pfad
es: Ruta del OTR / O2R
fr: Chemin de l'OTR / O2R
nl: OTR / O2R Pad

# otrContentView_otrSelect
source: Select
de: Wähle
es: Seleccionar
fr: Sélectionner
nl: Selecteer

# otrContentView_step1
source: 1. Select OTR / O2R that you want to replace textures from
de: 1. Wähle OTR / O2R dessen Texturen du austauschen möchtest
es: 1. Seleccione un OTR / O2R del que desee reemplazar texturas
fr: 1. Sélectionnez l'OTR / O2R à partir duquel vous souhaitez remplacer les textures.
nl: 1. Selecteer OTR / O2R waar in je textures wilt vervangen

# otrContentView_step2
source: 2. We extract texture assets as PNG with correct folder structure
de: 2. Wir extrahieren Texturen Assets als PNG mit korrekter Ordner Struktur
es: 2. Extraemos las texturas como PNG con la estructura de carpetas correcta
fr: 2. Nous extrayons les assets de texture en PNG avec une structure de dossier correcte.
nl: 2. We extracten texture assets als PNG met de juiste mapstructuur

# otrContentView_step3
source: 3. You replace the textures in that extraction folder
de: 3. Ersetze die Texturen in dem Ordner mit den extrahierten Texturen
es: 3. Reemplace las texturas de la carpeta de extracción
fr: 3. Vous remplacez les textures dans ce dossier d'extraction
nl: 3. Je vervangd textures in die aangemaakte map

# otrContentView_step4
source: 4. Run this flow again and present your extraction folder
de: 4. Führe diesen Flow erneut aus und wähle deinen Extrahier-Ordner
es: 4. Ejecute este procedimiento de nuevo y seleccione la carpeta de extracción
fr: 4. Exécutez à nouveau l'opération et choisissez votre dossier d'extraction
nl: 4. Voer dit process opnieuw uit en voer je extractiemap in

# otrContentView_step5
source: 5. We generate an OTR / O2R with the changed textures! 🚀
de: 5. Wir generieren eine OTR / O2R mit anderen Texturen! 🚀
es: 5. ¡Generamos un OTR / O2R con las texturas modificadas! 🚀
fr: 5. Nous générons un OTR / O2R avec les textures modifiées! 🚀
nl: 5. We genereren een OTR / O2R met de gewijzigde textures! 🚀

# otrContentView_processing
source: Processing...
de: Verarbeite...
es: Procesando...
fr: Traitement en cours...
nl: Verwerken...

# folderContentView_customTexturePath
source: Custom Texture Replacements Folder
de: Benutzeridentifizierter Austausch-Texturen Ordner
es: Carpeta de reemplazos de texturas personalizadas
fr: Dossier de remplacements de textures personnalisées
nl: Vervangende Texture Map

# folderContentView_prependAltToggle
source: Prepend `alt/`. This will allow players to toggle these assets on-the-fly in game.
de: Füge einen `alt/` Dies ermöglicht es den Spielern, Assets im Spiel zu aktivieren oder zu deaktivieren.
es: Agregar en `alt/`. Esto permitirá a los jugadores cambiar los recursos durante el juego.
fr: Ajouter un dossier `alt/` à votre OTR / O2R. Permet aux joueurs d'activer ou désactiver les assets en jeu.
nl: Voeg 'alt/' toe aan het begin. Dit stelt spelers in staat om deze assets tijdens het spel direct aan en uit te zetten.

# folderContentView_compressToggle
source: Compress Files. This will reduce the size of the OTR / O2R.
de: Dateien komprimieren. Dadurch wird die Größe der OTR / O2R reduziert.
fr: Compresser les fichiers. Cela réduira la taille de l'OTR / O2R.
nl: Bestanden comprimeren. Dit zal de grootte van de OTR / O2R verkleinen.

# folderContentView_selectButton
source: Select
de: Wähle
es: Seleccionar
fr: Sélectionner
nl: Selecteer

# folderContentView_stageTextures
source: Stage Textures
de: Texturen indexieren
es: Agregar texturas
fr: Indexer les textures

# createCustomSequences_addCustomSequences
source: Add Custom Sequences
de: Füge benutzeridentifizierte Sequenzen hinzu
es: Agregar secuencias personalizadas
fr: Ajouter des séquences personnalisées
nl: Voeg aangepaste composities toe

# createCustomSequences_addCustomSequencesDescription
source: Select a folder with sequences and meta files
de: Wähle einen einen Ornder mit Sequenzen und meta Dateien
es: Seleccione una carpeta con secuencias y archivos meta
fr: Sélectionnez un dossier contenant des séquences et des fichiers méta
nl: Selecteer een map met composities en metabestanden

# createCustomSequences_SequencesFolderPath
source: Sequences Folder Path
de: Sequenzen Ordner Pfad
es: Ruta de la carpeta de secuencias
fr: Chemin du dossier des séquences
nl: Composities Map

# createCustomSequences_selectButton
source: Select
de: Wähle
es: Seleccionar
fr: Sélectionner
nl: Selecteer

# createCustomSequences_stageFiles
source: Stage Files
de: Dateien indexieren
es: Agregar archivos
fr: Indexer les fichiers
nl: Stage-bestanden

# createFinishScreen_finish
source: Finish
de: Beenden
es: Finalizar
fr: Terminer
nl: Klaar

# createFinishScreen_finishSubtitle
source: Review your OTR / O2R details
de: Übersicht über deine OTR / O2R Details
es: Compruebe los detalles de su OTR / O2R
fr: Vérifiez les détails de votre OTR / O2R
nl: Controleer jouw OTR / O2R-gegevens

# createFinishScreen_generateOtr
source: Generate OTR / O2R
de: Generiere OTR / O2R
es: Generar OTR / O2R
fr: Générer l'OTR / O2R

# components_ephemeralBar_finalizeOtr
source: Finalize OTR / O2R ⚡️
de: Vollende OTR / O2R ⚡️
es: Finalizar OTR / O2R ⚡️
fr: Finaliser l'OTR / O2R ⚡️
nl: Proces afgerond OTR / O2R ⚡️

# createCustomScreen_title
source: Custom Directory
de: Via Pfad
es: Por ruta
fr: OTR / O2R Personnalisé par le chemin
nl: Via Pad

# createCustomScreen_subtitle
source: Select directory to pack as .otr
de: Wähle Dateien, die im Pfad platziert werden sollen
es: Seleccione archivos que desee colocar en la ruta
fr: Sélectionnez les fichiers à placer dans le chemin
nl: Selecteer bestanden om op pad te plaatsen

# createCustomScreen_labelPath
source: Path
de: Pfad
es: Ruta
fr: Chemin
nl: Pad

# createCustomScreen_selectButton
source: Select Directory
de: Wähle Dateien
es: Seleccionar archivos
fr: Sélectionnez les fichiers
nl: Selecteer bestanden

# createCustomScreen_fileToInsert
source: Files to insert:
de: Dateien zum Einfügen:
es: Archivos para insertar:
fr: Fichiers à ajouter:
nl: Bestanden om in te voegen:

# createCustomScreen_stageFiles
source: Stage Files
es: Agregar archivos
fr: Indexer les fichiers
nl: Stage-bestanden

# inspectOtrScreen_inspectOtr
source: Inspect OTR / O2R
de: Überprüfe OTR / O2R
es: Inspeccionar OTR / O2R
fr: Inspecter un OTR / O2R
nl: Inspecteer OTR / O2R

# inspectOtrScreen_inspectOtrSubtitle
source: Inspect the contents of an OTR / O2R
de: Überprüfe die Inhalte einer OTR / O2R
es: Inspeccione el contenido de un OTR / O2R
fr: Inspecter le contenu d'un OTR / O2R
nl: Inspecteer de inhoud van een OTR / O2R

# inspectOtrScreen_noOtrSelected
source: No OTR / O2R Selected
de: Keine OTR / O2R ausgewählt
es: No se ha seleccionado un OTR / O2R
fr: Aucun OTR / O2R sélectionné
nl: Geen OTR / O2R geselecteerd

# inspectOtrScreen_selectButton
source: Select
de: Wähle
es: Seleccionar
fr: Sélectionner
nl: Selecteer

# inspectOtrScreen_search
source: Search
de: Suchen
es: Buscar
fr: Rechercher
nl: Zoek

# gameSelectionScreen_title
source: Game Specific Tools
fr: Outils Spécifiques au Jeu
nl: Specifieke Tools

# gameSelectionScreen_subtitle
source: Select the game you want to create a selection for
fr: Sélectionnez le jeu pour lequel vous souhaitez créer une sélection
nl: Selecteer het spel waarvoor je een selectie wilt maken

# gameSelectionScreenSoh_subtitle
source: Select the tool you want to use
fr: Sélectionnez l'outil que vous souhaitez utiliser
nl: Selecteer de tool die je wilt gebruiken

# sohCreateDebugFontScreen_title
source: Debug Font Converter
fr: Générateur de Police de Débogage
nl: Debug Lettertype Genereren

# sohCreateDebugFontScreen_subtitle
source: Convert and generate fonts for the soh map selector
fr: Convertit et génère des polices pour le sélecteur de cartes du soh
nl: Genereer debug-lettertypen voor de soh map selector

# gameSelectionScreen2Ship_subtitle
source: Select the tool you want to use
fr: Sélectionnez l'outil que vous souhaitez utiliser
nl: Selecteer de tool die je wilt gebruiken

# gameSelection2ShipComingSoon_text
source: 2 Ship 2 Harkinian Tools are coming soon!
fr: Les outils 2 Ship 2 Harkinian arrivent bientôt!
nl: Tools voor 2 Ship 2 Harkinian komen binnenkort!

# extractModsWarning_part1
source: Extracting existing mods
fr: Extraire des mods déjà existants
nl: Bestaande mods extraheren

# extractModsWarning_part2
source: might not work properly.
fr: Ça pourrait ne pas fonctionner.
nl: Het zou niet kunnen werken.

# otrContentView_details
source: Details
es: Detalles
